micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extension module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_RCC_EX_H
#define STM32N6xx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_def.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection  Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_ADC         (0x0000000000000001UL)
#define RCC_PERIPHCLK_ADF1        (0x0000000000000002UL)
#define RCC_PERIPHCLK_CKPER       (0x0000000000000004UL)
#define RCC_PERIPHCLK_CSI         (0x0000000000000008UL)
#define RCC_PERIPHCLK_DCMIPP      (0x0000000000000010UL)
#define RCC_PERIPHCLK_ETH1        (0x0000000000000020UL)
#define RCC_PERIPHCLK_ETH1PHY     (0x0000000000000040UL)
#define RCC_PERIPHCLK_ETH1RX      (0x0000000000000080UL)
#define RCC_PERIPHCLK_ETH1TX      (0x0000000000000100UL)
#define RCC_PERIPHCLK_ETH1PTP     (0x0000000000000200UL)
#define RCC_PERIPHCLK_FDCAN       (0x0000000000000400UL)
#define RCC_PERIPHCLK_FMC         (0x0000000000000800UL)
#define RCC_PERIPHCLK_I2C1        (0x0000000000001000UL)
#define RCC_PERIPHCLK_I2C2        (0x0000000000002000UL)
#define RCC_PERIPHCLK_I2C3        (0x0000000000004000UL)
#define RCC_PERIPHCLK_I2C4        (0x0000000000008000UL)
#define RCC_PERIPHCLK_I3C1        (0x0000000000010000UL)
#define RCC_PERIPHCLK_I3C2        (0x0000000000020000UL)
#define RCC_PERIPHCLK_LPTIM1      (0x0000000000040000UL)
#define RCC_PERIPHCLK_LPTIM2      (0x0000000000080000UL)
#define RCC_PERIPHCLK_LPTIM3      (0x0000000000100000UL)
#define RCC_PERIPHCLK_LPTIM4      (0x0000000000200000UL)
#define RCC_PERIPHCLK_LPTIM5      (0x0000000000400000UL)
#define RCC_PERIPHCLK_LPUART1     (0x0000000000800000UL)
#define RCC_PERIPHCLK_LTDC        (0x0000000001000000UL)
#define RCC_PERIPHCLK_MDF1        (0x0000000002000000UL)
#define RCC_PERIPHCLK_PSSI        (0x0000000004000000UL)
#define RCC_PERIPHCLK_RTC         (0x0000000008000000UL)
#define RCC_PERIPHCLK_SAI1        (0x0000000010000000UL)
#define RCC_PERIPHCLK_SAI2        (0x0000000020000000UL)
#define RCC_PERIPHCLK_SDMMC1      (0x0000000040000000UL)
#define RCC_PERIPHCLK_SDMMC2      (0x0000000080000000UL)
#define RCC_PERIPHCLK_SPDIFRX1    (0x0000000100000000UL)
#define RCC_PERIPHCLK_SPI1        (0x0000000200000000UL)
#define RCC_PERIPHCLK_SPI2        (0x0000000400000000UL)
#define RCC_PERIPHCLK_SPI3        (0x0000000800000000UL)
#define RCC_PERIPHCLK_SPI4        (0x0000001000000000UL)
#define RCC_PERIPHCLK_SPI5        (0x0000002000000000UL)
#define RCC_PERIPHCLK_SPI6        (0x0000004000000000UL)
#define RCC_PERIPHCLK_TIM         (0x0000008000000000UL)
#define RCC_PERIPHCLK_USART1      (0x0000010000000000UL)
#define RCC_PERIPHCLK_USART2      (0x0000020000000000UL)
#define RCC_PERIPHCLK_USART3      (0x0000040000000000UL)
#define RCC_PERIPHCLK_UART4       (0x0000080000000000UL)
#define RCC_PERIPHCLK_UART5       (0x0000100000000000UL)
#define RCC_PERIPHCLK_USART6      (0x0000200000000000UL)
#define RCC_PERIPHCLK_UART7       (0x0000400000000000UL)
#define RCC_PERIPHCLK_UART8       (0x0000800000000000UL)
#define RCC_PERIPHCLK_UART9       (0x0001000000000000UL)
#define RCC_PERIPHCLK_USART10     (0x0002000000000000UL)
#define RCC_PERIPHCLK_USBPHY1     (0x0004000000000000UL)
#define RCC_PERIPHCLK_USBOTGHS1   (0x0008000000000000UL)
#define RCC_PERIPHCLK_USBPHY2     (0x0010000000000000UL)
#define RCC_PERIPHCLK_USBOTGHS2   (0x0020000000000000UL)
#define RCC_PERIPHCLK_XSPI1       (0x0040000000000000UL)
#define RCC_PERIPHCLK_XSPI2       (0x0080000000000000UL)
#define RCC_PERIPHCLK_XSPI3       (0x0100000000000000UL)
/**
  * @}
  */


/** @defgroup RCCEx_ADC_Clock_Source  ADC Clock Source
  * @{
  */
#define RCC_ADCCLKSOURCE_HCLK      LL_RCC_ADC_CLKSOURCE_HCLK
#define RCC_ADCCLKSOURCE_CLKP      LL_RCC_ADC_CLKSOURCE_CLKP
#define RCC_ADCCLKSOURCE_IC7       LL_RCC_ADC_CLKSOURCE_IC7
#define RCC_ADCCLKSOURCE_IC8       LL_RCC_ADC_CLKSOURCE_IC8
#define RCC_ADCCLKSOURCE_MSI       LL_RCC_ADC_CLKSOURCE_MSI
#define RCC_ADCCLKSOURCE_HSI       LL_RCC_ADC_CLKSOURCE_HSI
#define RCC_ADCCLKSOURCE_PIN       LL_RCC_ADC_CLKSOURCE_I2S_CKIN
#define RCC_ADCCLKSOURCE_TIMG      LL_RCC_ADC_CLKSOURCE_TIMG
/**
  * @}
  */

/** @defgroup RCCEx_ADF1_Clock_Source  ADF1 Clock Source
  * @{
  */
#define RCC_ADF1CLKSOURCE_HCLK     LL_RCC_ADF1_CLKSOURCE_HCLK
#define RCC_ADF1CLKSOURCE_CLKP     LL_RCC_ADF1_CLKSOURCE_CLKP
#define RCC_ADF1CLKSOURCE_IC7      LL_RCC_ADF1_CLKSOURCE_IC7
#define RCC_ADF1CLKSOURCE_IC8      LL_RCC_ADF1_CLKSOURCE_IC8
#define RCC_ADF1CLKSOURCE_MSI      LL_RCC_ADF1_CLKSOURCE_MSI
#define RCC_ADF1CLKSOURCE_HSI      LL_RCC_ADF1_CLKSOURCE_HSI
#define RCC_ADF1CLKSOURCE_PIN      LL_RCC_ADF1_CLKSOURCE_I2S_CKIN
#define RCC_ADF1CLKSOURCE_TIMG     LL_RCC_ADF1_CLKSOURCE_TIMG
/**
  * @}
  */

/** @defgroup RCCEx_CLKP_Clock_Source  CLKP Clock Source
  * @{
  */
#define RCC_CLKPCLKSOURCE_HSI      LL_RCC_CLKP_CLKSOURCE_HSI
#define RCC_CLKPCLKSOURCE_MSI      LL_RCC_CLKP_CLKSOURCE_MSI
#define RCC_CLKPCLKSOURCE_HSE      LL_RCC_CLKP_CLKSOURCE_HSE
#define RCC_CLKPCLKSOURCE_IC5      LL_RCC_CLKP_CLKSOURCE_IC5
#define RCC_CLKPCLKSOURCE_IC10     LL_RCC_CLKP_CLKSOURCE_IC10
#define RCC_CLKPCLKSOURCE_IC15     LL_RCC_CLKP_CLKSOURCE_IC15
#define RCC_CLKPCLKSOURCE_IC19     LL_RCC_CLKP_CLKSOURCE_IC19
#define RCC_CLKPCLKSOURCE_IC20     LL_RCC_CLKP_CLKSOURCE_IC20
/**
  * @}
  */

