micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @defgroup RCCEx_XSPI2_Clock_Source  XSPI2 Clock Source
  * @{
  */
#define RCC_XSPI2CLKSOURCE_HCLK    LL_RCC_XSPI2_CLKSOURCE_HCLK
#define RCC_XSPI2CLKSOURCE_CLKP    LL_RCC_XSPI2_CLKSOURCE_CLKP
#define RCC_XSPI2CLKSOURCE_IC3     LL_RCC_XSPI2_CLKSOURCE_IC3
#define RCC_XSPI2CLKSOURCE_IC4     LL_RCC_XSPI2_CLKSOURCE_IC4
/**
  * @}
  */

/** @defgroup RCCEx_XSPI3_Clock_Source  XSPI3 Clock Source
  * @{
  */
#define RCC_XSPI3CLKSOURCE_HCLK    LL_RCC_XSPI3_CLKSOURCE_HCLK
#define RCC_XSPI3CLKSOURCE_CLKP    LL_RCC_XSPI3_CLKSOURCE_CLKP
#define RCC_XSPI3CLKSOURCE_IC3     LL_RCC_XSPI3_CLKSOURCE_IC3
#define RCC_XSPI3CLKSOURCE_IC4     LL_RCC_XSPI3_CLKSOURCE_IC4
/**
  * @}
  */


/** @defgroup RCCEx_TIM_Prescaler_Selection TIM Prescaler Selection
  * @{
  */
#define RCC_TIMPRES_DIV1           LL_RCC_TIM_PRESCALER_1     /*!< Timers clocks prescaler divide by 1 */
#define RCC_TIMPRES_DIV2           LL_RCC_TIM_PRESCALER_2     /*!< Timers clocks prescaler divide by 2 */
#define RCC_TIMPRES_DIV4           LL_RCC_TIM_PRESCALER_4     /*!< Timers clocks prescaler divide by 4 */
#define RCC_TIMPRES_DIV8           LL_RCC_TIM_PRESCALER_8     /*!< Timers clocks prescaler divide by 8 */
/**
  * @}
  */

/** @defgroup RCCEx_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define RCC_PERIPH_FREQUENCY_NO        LL_RCC_PERIPH_FREQUENCY_NO /*!< No clock enabled for the peripheral            */
#define RCC_PERIPH_FREQUENCY_NA        LL_RCC_PERIPH_FREQUENCY_NA /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */

/** @defgroup RCCEx_IC_Selection_Max  Maximum IC Selection
  * @{
  */
#define RCC_IC_MAX_NUMBER              20U
/**
  * @}
  */

/** @defgroup RCCEx_IC_Selection  IC Selection
  * @{
  */
#define RCC_IC1                         0U   /*!< IC1 source is PLL1 output by default */
#define RCC_IC2                         1U   /*!< IC2 source is PLL1 output by default */
#define RCC_IC3                         2U   /*!< IC3 source is PLL1 output by default */
#define RCC_IC4                         3U   /*!< IC4 source is PLL1 output by default */
#define RCC_IC5                         4U   /*!< IC5 source is PLL1 output by default */
#define RCC_IC6                         5U   /*!< IC6 source is PLL1 output by default */
#define RCC_IC7                         6U   /*!< IC7 source is PLL2 output by default */
#define RCC_IC8                         7U   /*!< IC8 source is PLL2 output by default */
#define RCC_IC9                         8U   /*!< IC9 source is PLL2 output by default */
#define RCC_IC10                        9U   /*!< IC10 source is PLL2 output by default */
#define RCC_IC11                       10U   /*!< IC11 source is PLL1 output by default */
#define RCC_IC12                       11U   /*!< IC12 source is PLL3 output by default */
#define RCC_IC13                       12U   /*!< IC13 source is PLL3 output by default */
#define RCC_IC14                       13U   /*!< IC14 source is PLL3 output by default */
#define RCC_IC15                       14U   /*!< IC15 source is PLL3 output by default */
#define RCC_IC16                       15U   /*!< IC16 source is PLL4 output by default */
#define RCC_IC17                       16U   /*!< IC17 source is PLL4 output by default */
#define RCC_IC18                       17U   /*!< IC18 source is PLL4 output by default */
#define RCC_IC19                       18U   /*!< IC19 source is PLL4 output by default */
#define RCC_IC20                       19U   /*!< IC20 source is PLL4 output by default */
/**
  * @}
  */

/** @defgroup RCCEx_EXTI_LINE_LSECSS  LSE CSS external interrupt line
  * @{
  */
#define RCC_EXTI_LINE_LSECSS           EXTI_IMR3_IM65        /*!< LSE CSS failure interrupt connected to direct EXTI line 65 (Tamper) */
/**
  * @}
  */

/** @defgroup RCC_PLL_Selection  PLL selection
  * @{
  */
#define RCC_PLL1           0U
#define RCC_PLL2           1U
#define RCC_PLL3           2U
#define RCC_PLL4           3U
/**
  * @}
  */

/** @defgroup RCC_PLL_SSCGSpread_Mode  PLL SSCG spread mode selection
  * @{
  */
#define RCC_PLL_SSCG_CENTER            0U                  /*!< PLL SSCG center spread modulation */
#define RCC_PLL_SSCG_DOWN              1U                  /*!< PLL SSCG down spread modulation */
/**
  * @}
  */

/**
  * @}
  */


/* Exported types ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint64_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  RCC_ICInitTypeDef ICSelection[RCC_IC_MAX_NUMBER]; /*!< ICx structure parameters.
                                        This parameter shall be used when ICx is selected as kernel clock source
                                        for some peripherals */

  uint32_t FmcClockSelection;      /*!< Specifies FMC clock source.
                                        This parameter can be a value of @ref RCCEx_FMC_Clock_Source    */

  uint32_t Xspi1ClockSelection;    /*!< Specifies XSPI1 clock source.
                                        This parameter can be a value of @ref RCCEx_XSPI1_Clock_Source  */

  uint32_t Xspi2ClockSelection;    /*!< Specifies XSPI2 clock source.
                                        This parameter can be a value of @ref RCCEx_XSPI2_Clock_Source  */

  uint32_t Xspi3ClockSelection;    /*!< Specifies XSPI3 clock source.
                                        This parameter can be a value of @ref RCCEx_XSPI3_Clock_Source  */

  uint32_t CkperClockSelection;   /*!< Specifies CKPER clock source.
                                        This parameter can be a value of @ref RCCEx_CLKP_Clock_Source   */

  uint32_t AdcClockSelection;      /*!< Specifies ADC interface clock source.
                                        This parameter can be a value of @ref RCCEx_ADC_Clock_Source     */

  uint32_t AdcDivider;             /*!< Specifies ADC clock divider.
                                        This parameter can be a value between 1 to 256 */

  uint32_t Adf1ClockSelection;     /*!< Specifies ADF1 Clock clock source.
                                        This parameter can be a value of @ref RCCEx_ADF1_Clock_Source    */

  uint32_t DcmippClockSelection;   /*!< Specifies DCMIPP clock source.
                                        This parameter can be a value of @ref RCCEx_DCMIPP_Clock_Source  */

  uint32_t Eth1ClockSelection;     /*!< Specifies ETH1 clock source.
                                        This parameter can be a value of @ref RCCEx_ETH1_Clock_Source    */

  uint32_t Eth1PhyInterfaceSelection;  /*!< Specifies ETH1 PHY interface.
                                        This parameter can be a value of @ref RCCEx_ETH1_PHY_Interface */

