micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
  uint32_t Uart7ClockSelection;    /*!< Specifies UART7 clock source.
                                        This parameter can be a value of @ref RCCEx_UART7_Clock_Source  */

  uint32_t Uart8ClockSelection;    /*!< Specifies UART8 clock source.
                                        This parameter can be a value of @ref RCCEx_UART8_Clock_Source  */

  uint32_t Uart9ClockSelection;    /*!< Specifies UART9 clock source.
                                        This parameter can be a value of @ref RCCEx_UART9_Clock_Source  */

  uint32_t Usart10ClockSelection;  /*!< Specifies USART10 clock source.
                                        This parameter can be a value of @ref RCCEx_USART10_Clock_Source  */

  uint32_t UsbPhy1ClockSelection;  /*!< Specifies USBPHY1 clock source.
                                        This parameter can be a value of @ref RCCEx_USBPHY1_Clock_Source */

  uint32_t UsbOtgHs1ClockSelection; /*!< Specifies USB OTG HS1 clock source.
                                        This parameter can be a value of @ref RCCEx_USB_OTGHS1_Clock_Source */

  uint32_t UsbPhy2ClockSelection;  /*!< Specifies USBPHY2 clock source.
                                        This parameter can be a value of @ref RCCEx_USBPHY2_Clock_Source */

  uint32_t UsbOtgHs2ClockSelection; /*!< Specifies USB OTG HS2 clock source.
                                        This parameter can be a value of @ref RCCEx_USB_OTGHS2_Clock_Source */

  uint32_t RTCClockSelection;      /*!< Specifies RTC Clock clock source.
                                        This parameter can be a value of @ref RCC_RTC_Clock_Source       */

  uint32_t TIMPresSelection;       /*!< Specifies TIM Clock Prescalers Selection.
                                        This parameter can be a value of @ref RCCEx_TIM_Prescaler_Selection */
} RCC_PeriphCLKInitTypeDef;

/**
  * @brief  RCC Extended PLL configuration structure definition
  *         (allow to configure the PLL in SSCG mode)
  */
typedef struct
{
  uint32_t PLLModDiv;                /*!< Modulation division frequency.
                                      This parameter must be a number between Min_Data = 0 and Max_Data = 0xF */
  uint32_t PLLModSpreadDepth;        /*!< Modulation spread spectrum depth.
                                      This parameter must be a number between Min_Data = 0 and Max_Data = 0x1F */
  uint32_t PLLModSpreadMode;         /*!< Modulation spread spectrum mode.
                                      This parameter must be a value of @ref RCC_PLL_SSCGSpread_Mode */
} RCC_PLLSSCGInitTypeDef;
/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros  RCCEx Exported Macros
  * @{
  */

/**
  * @brief  Macro to configure the PLL1 SSCG Spread Depth
  * @note   This configuration cannot be requested when the PLL1 has been enabled.
  *
  * @param  __PLLMODSPR__ specifies the SSCG modulation spread depth.
  *                         It should be a value between 0 and 0x1F.
  * @retval None
  */
#define  __HAL_RCC_PLL1_MODSPR_CONFIG(__PLLMODSPR__) \
  MODIFY_REG(RCC->PLL1CFGR3, RCC_PLL1CFGR3_PLL1MODSPR, (uint32_t)(__PLLMODSPR__) << RCC_PLL1CFGR3_PLL1MODSPR_Pos)

/**
  * @brief  Macro to configure the PLL1 SSCG Spread Mode
  * @note   This configuration cannot be requested when the PLL1 has been enabled.
  *
  * @param  __PLLMODSPRDW__ specifies the SSCG modulation spread mode.
  *                         It should be a value of @ref RCC_PLL_SSCGSpread_Mode
  * @retval None
  */
#define  __HAL_RCC_PLL1_MODSPRDW_CONFIG(__PLLMODSPRDW__) \
  MODIFY_REG(RCC->PLL1CFGR3, RCC_PLL1CFGR3_PLL1MODSPRDW, (uint32_t)(__PLLMODSPRDW__) << RCC_PLL1CFGR3_PLL1MODSPRDW_Pos)


/**
  * @brief  Macro to configure the PLL2 SSCG Spread Depth
  * @note   This configuration cannot be requested when the PLL2 has been enabled.
  *
  * @param  __PLLMODSPR__ specifies the SSCG modulation spread depth.
  *                         It should be a value between 0 and 0x1F.
  * @retval None
  */
#define  __HAL_RCC_PLL2_MODSPR_CONFIG(__PLLMODSPR__) \
  MODIFY_REG(RCC->PLL2CFGR3, RCC_PLL2CFGR3_PLL2MODSPR, (uint32_t)(__PLLMODSPR__) << RCC_PLL2CFGR3_PLL2MODSPR_Pos)

/**
  * @brief  Macro to configure the PLL2 SSCG Spread Mode
  * @note   This configuration cannot be requested when the PLL2 has been enabled.
  *
  * @param  __PLLMODSPRDW__ specifies the SSCG modulation spread mode.
  *                         It should be a value of @ref RCC_PLL_SSCGSpread_Mode
  * @retval None
  */
#define  __HAL_RCC_PLL2_MODSPRDW_CONFIG(__PLLMODSPRDW__) \
  MODIFY_REG(RCC->PLL2CFGR3, RCC_PLL2CFGR3_PLL2MODSPRDW, (uint32_t)(__PLLMODSPRDW__) << RCC_PLL2CFGR3_PLL2MODSPRDW_Pos)


/**
  * @brief  Macro to configure the PLL3 SSCG Spread Depth
  * @note   This configuration cannot be requested when the PLL3 has been enabled.
  *
  * @param  __PLLMODSPR__ specifies the SSCG modulation spread depth.
  *                         It should be a value between 0 and 0x1F.
  * @retval None
  */
#define  __HAL_RCC_PLL3_MODSPR_CONFIG(__PLLMODSPR__) \
  MODIFY_REG(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSPR, (uint32_t)(__PLLMODSPR__) << RCC_PLL3CFGR3_PLL3MODSPR_Pos)

/**
  * @brief  Macro to configure the PLL3 SSCG Spread Mode
  * @note   This configuration cannot be requested when the PLL3 has been enabled.
  *
  * @param  __PLLMODSPRDW__ specifies the SSCG modulation spread mode.
  *                         It should be a value of @ref RCC_PLL_SSCGSpread_Mode
  * @retval None
  */
#define  __HAL_RCC_PLL3_MODSPRDW_CONFIG(__PLLMODSPRDW__) \
  MODIFY_REG(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSPRDW, (uint32_t)(__PLLMODSPRDW__) << RCC_PLL3CFGR3_PLL3MODSPRDW_Pos)


/**
  * @brief  Macro to configure the PLL4 SSCG Spread Depth
  * @note   This configuration cannot be requested when the PLL4 has been enabled.
  *
  * @param  __PLLMODSPR__ specifies the SSCG modulation spread depth.
  *                         It should be a value between 0 and 0x1F.
  * @retval None
  */
#define  __HAL_RCC_PLL4_MODSPR_CONFIG(__PLLMODSPR__) \
  MODIFY_REG(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSPR, (uint32_t)(__PLLMODSPR__) << RCC_PLL4CFGR3_PLL4MODSPR_Pos)

/**
  * @brief  Macro to configure the PLL4 SSCG Spread Mode
  * @note   This configuration cannot be requested when the PLL4 has been enabled.
  *
  * @param  __PLLMODSPRDW__ specifies the SSCG modulation spread mode.
  *                         It should be a value of @ref RCC_PLL_SSCGSpread_Mode
  * @retval None
  */
#define  __HAL_RCC_PLL4_MODSPRDW_CONFIG(__PLLMODSPRDW__) \
  MODIFY_REG(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSPRDW, (uint32_t)(__PLLMODSPRDW__) << RCC_PLL4CFGR3_PLL4MODSPRDW_Pos)


/** @brief  Macro to configure the ADC clock
  * @param  __ADC_CLKSOURCE__ specifies the ADC  clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_ADCCLKSOURCE_HCLK   HCLK Clock selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_CLKP   CLKP selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_IC7    IC7 selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_IC8    IC8 selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_MSI    MSI selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_HSI    HSI selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_PIN    External I2S_CKIN selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_TIMG   TIMG selected as ADC clock
  */
#define __HAL_RCC_ADC_CONFIG(__ADC_CLKSOURCE__) \
  LL_RCC_SetADCClockSource((__ADC_CLKSOURCE__))

/** @brief  Macro to get the ADC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ADCCLKSOURCE_HCLK   HCLK Clock selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_CLKP   CLKP selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_IC7    IC7 selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_IC8    IC8 selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_MSI    MSI selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_HSI    HSI selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_PIN    External I2S_CKIN selected as ADC clock
  *            @arg RCC_ADCCLKSOURCE_TIMG   TIMG selected as ADC clock
  */
#define __HAL_RCC_GET_ADC_SOURCE() LL_RCC_GetADCClockSource(LL_RCC_ADC_CLKSOURCE)

/** @brief  Macro to configure the ADC clock divider.
  * @param  __ADC_DIVIDER__ specifies  clock divider for ADC.
  *         This parameter can be a value between 1 and 256.
  */
#define __HAL_RCC_ADC_DIVIDER_CONFIG(__ADC_DIVIDER__) LL_RCC_SetADCPrescaler((__ADC_DIVIDER__) - 1U)

/** @brief  Macro to get the ADC clock divider.
  * @retval The divider can be a value between 1 and 256.
  */
#define __HAL_RCC_GET_ADC_DIVIDER() (LL_RCC_GetADCPrescaler() + 1U)

/** @brief  Macro to configure the ADF1 clock
  * @param  __ADF1_CLKSOURCE__ specifies the ADF1  clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_ADF1CLKSOURCE_HCLK   HCLK Clock selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_CLKP   CLKP selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_IC7    IC7 selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_IC8    IC8 selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_MSI    MSI selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_HSI    HSI selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_PIN    External I2S_CKIN selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_TIMG   TIMG selected as ADF1 clock
  */
#define __HAL_RCC_ADF1_CONFIG(__ADF1_CLKSOURCE__) \
  LL_RCC_SetADFClockSource((__ADF1_CLKSOURCE__))

