micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the ADF1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ADF1CLKSOURCE_HCLK   HCLK Clock selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_CLKP   CLKP selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_IC7    IC7 selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_IC8    IC8 selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_MSI    MSI selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_HSI    HSI selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_PIN    External I2S_CKIN selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_TIMG   TIMG selected as ADF1 clock
  */
#define __HAL_RCC_GET_ADF1_SOURCE() LL_RCC_GetADFClockSource(LL_RCC_ADF1_CLKSOURCE)

/** @brief  Macro to configure the CLKP clock for peripheral
  * @param  __CLKP_CLKSOURCE__ specifies the clock for peripheral
  *         This parameter can be one of the following values:
  *            @arg RCC_CLKPCLKSOURCE_HSI     HSI selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_MSI     MSI selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_HSE     HSE selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC5     IC5 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC10    IC10 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC15    IC15 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC19    IC19 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC20    IC20 selected as CLKP clock
  */
#define __HAL_RCC_CLKP_CONFIG(__CLKP_CLKSOURCE__) \
  LL_RCC_SetCLKPClockSource((__CLKP_CLKSOURCE__))

/** @brief  Macro to get the Oscillator clock for peripheral source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_CLKPCLKSOURCE_HSI     HSI selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_MSI     MSI selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_HSE     HSE selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC5     IC5 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC10    IC10 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC15    IC15 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC19    IC19 selected as CLKP clock
  *            @arg RCC_CLKPCLKSOURCE_IC20    IC20 selected as CLKP clock
  */
#define __HAL_RCC_GET_CLKP_SOURCE() LL_RCC_GetCLKPClockSource(LL_RCC_CLKP_CLKSOURCE)

/** @brief  Macro to configure the DCMIPP clock source.
  *
  * @param  __DCMIPP_CLKSOURCE__ specifies the DCMIPP clock source.
  *            @arg RCC_DCMIPPCLKSOURCE_PCLK5 PCLK5 selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_CLKP  CLKP selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_IC17  IC17 selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_HSI   HSI selected as DCMIPP clock
  */
#define __HAL_RCC_DCMIPP_CONFIG(__DCMIPP_CLKSOURCE__) \
  LL_RCC_SetDCMIPPClockSource((__DCMIPP_CLKSOURCE__))

/** @brief  Macro to get the DCMIPP clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_DCMIPPCLKSOURCE_PCLK5 PCLK5 selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_CLKP  CLKP selected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_IC17  IC17 elected as DCMIPP clock
  *            @arg RCC_DCMIPPCLKSOURCE_HSI   HSI selected as DCMIPP clock
  */
#define __HAL_RCC_GET_DCMIPP_SOURCE() LL_RCC_GetDCMIPPClockSource(LL_RCC_DCMIPP_CLKSOURCE)

/** @brief  Macro to configure the ETH1 kernel clock source.
  * @param  __ETH1_CLKSOURCE__ specifies  clock source for ETH1
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1CLKSOURCE_HCLK    HCLK selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_CLKP    CLKP selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_IC12    IC12 selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_HSE     HSE selected as ETH1 clock
  */
#define __HAL_RCC_ETH1_CONFIG(__ETH1_CLKSOURCE__) \
  LL_RCC_SetETHClockSource(__ETH1_CLKSOURCE__)

/** @brief  Macro to get the ETH1 kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1CLKSOURCE_HCLK    HCLK selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_CLKP    CLKP selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_IC12    IC12 selected as ETH1 clock
  *            @arg RCC_ETH1CLKSOURCE_HSE     HSE selected as ETH1 clock
  */
#define __HAL_RCC_GET_ETH1_SOURCE() LL_RCC_GetETHClockSource(LL_RCC_ETH1_CLKSOURCE)

/** @brief  Macro to configure the ETH1 PHY interface.
  * @note   This configuration must be done while ETH1 is under reset,
  *         and before enabling the ETH1 clocks
  * @param  __ETH1PHY_IF__ specifies  interface for ETH1 PHY
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1PHYIF_MII   MII selected as ETH1 PHY interface
  *            @arg RCC_ETH1PHYIF_RGMII RGMII selected as ETH1 PHY interface
  *            @arg RCC_ETH1PHYIF_RMII  RMII selected as ETH1 PHY interface
  */
#define __HAL_RCC_ETH1PHY_CONFIG(__ETH1PHY_IF__) \
  LL_RCC_SetETHPHYInterface(__ETH1PHY_IF__)

/** @brief  Macro to get the ETH PHY clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1PHYIF_MII   MII selected as ETH1 PHY interface
  *            @arg RCC_ETH1PHYIF_RGMII RGMII selected as ETH1 PHY interface
  *            @arg RCC_ETH1PHYIF_RMII  RMII selected as ETH1 PHY interface
  */
#define __HAL_RCC_GET_ETH1PHY_INTERFACE() LL_RCC_GetETHPHYInterface(LL_RCC_ETH1PHY_IF)

/** @brief  Macro to configure the ETH1 reference Rx clock source.
  * @param  __ETH1RX_CLKSOURCE__ specifies  clock source for ETH1 reference Rx
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1RXCLKSOURCE_EXT    External clock selected as ETH1 reference Rx clock
  *            @arg RCC_ETH1RXCLKSOURCE_INT    Internal kernel selected as ETH1 reference Rx clock
  */
#define __HAL_RCC_ETH1RX_CONFIG(__ETH1RX_CLKSOURCE__) \
  LL_RCC_SetETHREFRXClockSource(__ETH1RX_CLKSOURCE__)

/** @brief  Macro to get the ETH1 reference Rx clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1RXCLKSOURCE_EXT    External clock selected as ETH1 reference Rx clock
  *            @arg RCC_ETH1RXCLKSOURCE_INT    Internal kernel selected as ETH1 reference Rx clock
  */
#define __HAL_RCC_GET_ETH1RX_SOURCE() LL_RCC_GetETHREFRXClockSource(LL_RCC_ETH1REFRX_CLKSOURCE)

/** @brief  Macro to configure the ETH1 reference Tx RGMII 125MHz clock source.
  * @param  __ETH1TX_CLKSOURCE__ specifies  clock source for ETH1 reference Tx
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1TXCLKSOURCE_EXT    External clock selected as ETH1 reference Tx clock
  *            @arg RCC_ETH1TXCLKSOURCE_INT    Internal kernel selected as ETH1 reference Tx clock
  */
#define __HAL_RCC_ETH1TX_CONFIG(__ETH1TX_CLKSOURCE__) \
  LL_RCC_SetETHREFTXClockSource(__ETH1TX_CLKSOURCE__)

/** @brief  Macro to get the ETH1 reference Tx RGMII 125MHz clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1TXCLKSOURCE_EXT    External clock selected as ETH1 reference Tx clock
  *            @arg RCC_ETH1TXCLKSOURCE_INT    Internal kernel selected as ETH1 reference Tx clock
  */
#define __HAL_RCC_GET_ETH1TX_SOURCE() LL_RCC_GetETHREFTXClockSource(LL_RCC_ETH1REFTX_CLKSOURCE)

