micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to configure the ETH1 PTP clock source.
  * @param  __ETH1PTP_CLKSOURCE__ specifies  clock source for ETH1 PTP
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1PTPCLKSOURCE_HCLK    HCLK selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_CLKP    CLKP selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_IC13    IC13 selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_HSE     HSE selected as ETH1 PTP clock
  */
#define __HAL_RCC_ETH1PTP_CONFIG(__ETH1PTP_CLKSOURCE__) \
  LL_RCC_SetETHPTPClockSource(__ETH1PTP_CLKSOURCE__)

/** @brief  Macro to get the ETH1 PTP clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1PTPCLKSOURCE_HCLK    HCLK selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_CLKP    CLKP selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_IC13    IC13 selected as ETH1 PTP clock
  *            @arg RCC_ETH1PTPCLKSOURCE_HSE     HSE selected as ETH1 PTP clock
  */
#define __HAL_RCC_GET_ETH1PTP_SOURCE() LL_RCC_GetETHPTPClockSource(LL_RCC_ETH1PTP_CLKSOURCE)

/** @brief  Macro to configure the ETH1 PTP divider.
  * @param  __ETH1PTP_DIVIDER__ specifies  clock divider for ETH1 PTP
  *         This parameter can be a value between 1 and 16.
  */
#define __HAL_RCC_ETH1PTP_DIVIDER_CONFIG(__ETH1PTP_DIVIDER__) \
  LL_RCC_SetETH1PTPDivider(((__ETH1PTP_DIVIDER__) - 1U) << RCC_CCIPR2_ETH1PTPDIV_Pos)

/** @brief  Macro to get the ETH1 PTP divider.
  * @retval The divider can be a value between 1 and 16.
  */
#define __HAL_RCC_GET_ETH1PTP_DIVIDER() \
  ((LL_RCC_GetETH1PTPDivider() >> RCC_CCIPR2_ETH1PTPDIV_Pos) + 1U)

/** @brief  Macro to configure the FDCAN kernel clock source.
  * @param  __FDCAN_CLKSOURCE__ specifies  clock source for FDCAN kernel
  *         This parameter can be one of the following values:
  *            @arg RCC_FDCANCLKSOURCE_PCLK1  PCLK1 selected as FDCAN kernel clock (default)
  *            @arg RCC_FDCANCLKSOURCE_CLKP   CLKP selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_IC19   IC19 selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_HSE    HSE selected as FDCAN kernel clock
  */
#define __HAL_RCC_FDCAN_CONFIG(__FDCAN_CLKSOURCE__) \
  LL_RCC_SetFDCANClockSource((__FDCAN_CLKSOURCE__))

/** @brief  Macro to get the FDCAN kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_FDCANCLKSOURCE_PCLK1  PCLK1 selected as FDCAN kernel clock (default)
  *            @arg RCC_FDCANCLKSOURCE_CLKP   CLKP selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_IC19   IC19 selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_HSE    HSE selected as FDCAN kernel clock
  */
#define __HAL_RCC_GET_FDCAN_SOURCE() LL_RCC_GetFDCANClockSource(LL_RCC_FDCAN_CLKSOURCE)

/** @brief  Macro to configure the FMC clock source.
  *
  * @param  __FMC_CLKSOURCE__ specifies the FMC clock source.
  *            @arg RCC_FMCCLKSOURCE_HCLK  HCLK Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_CLKP  CLKP Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_IC3   IC3 Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_IC4   IC4 selected as FMC clock
  */
#define __HAL_RCC_FMC_CONFIG(__FMC_CLKSOURCE__) \
  LL_RCC_SetFMCClockSource((__FMC_CLKSOURCE__))

/** @brief  Macro to get the FMC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_FMCCLKSOURCE_HCLK  HCLK Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_CLKP  CLKP Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_IC3   IC3 Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_IC4   IC4 selected as FMC clock
  */
#define __HAL_RCC_GET_FMC_SOURCE() LL_RCC_GetFMCClockSource(LL_RCC_FMC_CLKSOURCE)

/** @brief  Macro to configure the I2C1 clock source.
  * @param  __I2C1_CLKSOURCE__ specifies the I2C1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C1CLKSOURCE_PCLK1    PCLK1 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_CLKP     CKLP selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_IC10     IC10 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_IC15     IC15 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_MSI      MSI selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_HSI      HSI selected as I2C1 clock
  */
#define __HAL_RCC_I2C1_CONFIG(__I2C1_CLKSOURCE__) \
  LL_RCC_SetI2CClockSource((__I2C1_CLKSOURCE__))

/** @brief  Macro to get the I2C1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C1CLKSOURCE_PCLK1    PCLK1 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_CLKP     CKLP selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_IC10     IC10 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_IC15     IC15 selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_MSI      MSI selected as I2C1 clock
  *            @arg RCC_I2C1CLKSOURCE_HSI      HSI selected as I2C1 clock
  */
#define __HAL_RCC_GET_I2C1_SOURCE() LL_RCC_GetI2CClockSource(LL_RCC_I2C1_CLKSOURCE)

/** @brief  Macro to configure the I2C2 clock source.
  * @param  __I2C2_CLKSOURCE__ specifies the I2C2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C2CLKSOURCE_PCLK1    PCLK1 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_CLKP     CKLP selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_IC10     IC10 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_IC15     IC15 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_MSI      MSI selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_HSI      HSI selected as I2C2 clock
  */
#define __HAL_RCC_I2C2_CONFIG(__I2C2_CLKSOURCE__) \
  LL_RCC_SetI2CClockSource((__I2C2_CLKSOURCE__))

