micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the I2C2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C2CLKSOURCE_PCLK1    PCLK1 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_CLKP     CKLP selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_IC10     IC10 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_IC15     IC15 selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_MSI      MSI selected as I2C2 clock
  *            @arg RCC_I2C2CLKSOURCE_HSI      HSI selected as I2C2 clock
  */
#define __HAL_RCC_GET_I2C2_SOURCE() LL_RCC_GetI2CClockSource(LL_RCC_I2C2_CLKSOURCE)

/** @brief  Macro to configure the I2C3 clock source.
  * @param  __I2C3_CLKSOURCE__ specifies the I2C3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C3CLKSOURCE_PCLK1    PCLK1 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_CLKP     CKLP selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_IC10     IC10 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_IC15     IC15 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_MSI      MSI selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_HSI      HSI selected as I2C3 clock
  */
#define __HAL_RCC_I2C3_CONFIG(__I2C3_CLKSOURCE__) \
  LL_RCC_SetI2CClockSource((__I2C3_CLKSOURCE__))

/** @brief  Macro to get the I2C3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C3CLKSOURCE_PCLK1    PCLK1 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_CLKP     CKLP selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_IC10     IC10 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_IC15     IC15 selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_MSI      MSI selected as I2C3 clock
  *            @arg RCC_I2C3CLKSOURCE_HSI      HSI selected as I2C3 clock
  */
#define __HAL_RCC_GET_I2C3_SOURCE() LL_RCC_GetI2CClockSource(LL_RCC_I2C3_CLKSOURCE)

/** @brief  Macro to configure the I2C4 clock source.
  * @param  __I2C4_CLKSOURCE__ specifies the I2C4 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C4CLKSOURCE_PCLK1    PCLK1 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_CLKP     CKLP selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_IC10     IC10 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_IC15     IC15 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_MSI      MSI selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_HSI      HSI selected as I2C4 clock
  */
#define __HAL_RCC_I2C4_CONFIG(__I2C4_CLKSOURCE__) \
  LL_RCC_SetI2CClockSource((__I2C4_CLKSOURCE__))

/** @brief  Macro to get the I2C4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C4CLKSOURCE_PCLK1    PCLK1 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_CLKP     CKLP selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_IC10     IC10 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_IC15     IC15 selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_MSI      MSI selected as I2C4 clock
  *            @arg RCC_I2C4CLKSOURCE_HSI      HSI selected as I2C4 clock
  */
#define __HAL_RCC_GET_I2C4_SOURCE() LL_RCC_GetI2CClockSource(LL_RCC_I2C4_CLKSOURCE)

/** @brief  Macro to configure the I3C1 clock source.
  * @param  __I3C1_CLKSOURCE__ specifies the I3C1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I3C1CLKSOURCE_PCLK1    PCLK1 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_CLKP     CKLP selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_IC10     IC10 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_IC15     IC15 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_MSI      MSI selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_HSI      HSI selected as I3C1 clock
  */
#define __HAL_RCC_I3C1_CONFIG(__I3C1_CLKSOURCE__) \
  LL_RCC_SetI3CClockSource((__I3C1_CLKSOURCE__))

/** @brief  Macro to get the I3C1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I3C1CLKSOURCE_PCLK1    PCLK1 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_CLKP     CKLP selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_IC10     IC10 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_IC15     IC15 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_MSI      MSI selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_HSI      HSI selected as I3C1 clock
  */
#define __HAL_RCC_GET_I3C1_SOURCE() LL_RCC_GetI3CClockSource(LL_RCC_I3C1_CLKSOURCE)

/** @brief  Macro to configure the I3C2 clock source.
  * @param  __I3C2_CLKSOURCE__ specifies the I3C2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I3C2CLKSOURCE_PCLK1    PCLK1 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_CLKP     CKLP selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_IC10     IC10 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_IC15     IC15 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_MSI      MSI selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_HSI      HSI selected as I3C2 clock
  */
#define __HAL_RCC_I3C2_CONFIG(__I3C2_CLKSOURCE__) \
  LL_RCC_SetI3CClockSource((__I3C2_CLKSOURCE__))

/** @brief  Macro to get the I3C2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I3C2CLKSOURCE_PCLK1    PCLK1 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_CLKP     CKLP selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_IC10     IC10 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_IC15     IC15 selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_MSI      MSI selected as I3C2 clock
  *            @arg RCC_I3C2CLKSOURCE_HSI      HSI selected as I3C2 clock
  */
#define __HAL_RCC_GET_I3C2_SOURCE() LL_RCC_GetI3CClockSource(LL_RCC_I3C2_CLKSOURCE)

/** @brief  Macro to configure the LPTIM1 clock source.
  * @param  __LPTIM1_CLKSOURCE__ specifies the LPTIM1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1  PCLK1 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_CLKP   CLKP clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_IC15   IC15 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE    LSE clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI    LSI clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_TIMG   TIMG clock selected as LPTIM1 clock
  */
#define __HAL_RCC_LPTIM1_CONFIG(__LPTIM1_CLKSOURCE__) \
  LL_RCC_SetLPTIMClockSource((__LPTIM1_CLKSOURCE__))

/** @brief  Macro to get the LPTIM1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1  PCLK1 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_CLKP   CLKP clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_IC15   IC15 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE    LSE clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI    LSI clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_TIMG   TIMG clock selected as LPTIM1 clock
  */
#define __HAL_RCC_GET_LPTIM1_SOURCE() LL_RCC_GetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE)

