micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to configure the LTDC clock (LTDCCLK).
  * @param  __LTDC_CLKSOURCE__ specifies the LTDC clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LTDCCLKSOURCE_PCLK5 PCLK5 Clock selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_CLKP  CLKP selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_IC16  IC14 selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_HSI   HSI selected as LTDC clock
  */
#define __HAL_RCC_LTDC_CONFIG(__LTDC_CLKSOURCE__) \
  LL_RCC_SetLTDCClockSource((__LTDC_CLKSOURCE__))

/** @brief  Macro to get the LTDC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LTDCCLKSOURCE_PCLK5 PCLK5 Clock selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_CLKP  CLKP selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_IC16  IC14 selected as LTDC clock
  *            @arg RCC_LTDCCLKSOURCE_HSI   HSI selected as LTDC clock
  */
#define __HAL_RCC_GET_LTDC_SOURCE() LL_RCC_GetLTDCClockSource(LL_RCC_LTDC_CLKSOURCE)

/** @brief  Macro to configure the MDF1 clock
  * @param  __MDF1_CLKSOURCE__ specifies the MDF1  clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_MDF1CLKSOURCE_HCLK   HCLK Clock selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_CLKP   CLKP selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_IC7    IC7 selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_IC8    IC8 selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_MSI    MSI selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_HSI    HSI selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_PIN    External I2S_CKIN selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_TIMG   TIMG selected as MDF1 clock
  */
#define __HAL_RCC_MDF1_CONFIG(__MDF1_CLKSOURCE__) \
  LL_RCC_SetMDFClockSource((__MDF1_CLKSOURCE__))

/** @brief  Macro to get the MDF1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_MDF1CLKSOURCE_HCLK   HCLK Clock selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_CLKP   CLKP selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_IC7    IC7 selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_IC8    IC8 selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_MSI    MSI selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_HSI    HSI selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_PIN    External I2S_CKIN selected as MDF1 clock
  *            @arg RCC_MDF1CLKSOURCE_TIMG   TIMG selected as MDF1 clock
  */
#define __HAL_RCC_GET_MDF1_SOURCE() LL_RCC_GetMDFClockSource(LL_RCC_MDF1_CLKSOURCE)

/**
  * @brief  Macro to configure the PSSI clock source.
  * @param  __PSSI_CLKSOURCE__ defines the PSSI clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_PSSICLKSOURCE_HCLK  HCLK selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_CLKP  Peripheral clock CLKP selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_IC20  IC20 selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_HSI   HSI selected as PSSI clock
  * @retval None
  */
#define __HAL_RCC_PSSI_CONFIG(__PSSI_CLKSOURCE__) \
  LL_RCC_SetPSSIClockSource((__PSSI_CLKSOURCE__))

/** @brief  Macro to get the PSSI clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_PSSICLKSOURCE_HCLK  HCLK selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_CLKP  Peripheral clock CLKP selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_IC20  IC20 selected as PSSI clock
  *            @arg RCC_PSSICLKSOURCE_HSI   HSI selected as PSSI clock
  */
#define __HAL_RCC_GET_PSSI_SOURCE() LL_RCC_GetPSSIClockSource(LL_RCC_PSSI_CLKSOURCE)

/**
  * @brief  Macro to configure the SAI1 clock source.
  * @param  __SAI1_CLKSOURCE__ defines the SAI1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SAI1CLKSOURCE_PCLK2  PCLK2 Clock selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_IC7    IC7 selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_IC8    IC8 selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_MSI    MSI selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_HSI    HSI selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_PIN    External I2S_CKIN selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_SPDIFRX1 SPDIFRX1 selected as SAI1 clock
  * @retval None
  */
#define __HAL_RCC_SAI1_CONFIG(__SAI1_CLKSOURCE__) \
  LL_RCC_SetSAIClockSource((__SAI1_CLKSOURCE__))

/** @brief  Macro to get the SAI1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SAI1CLKSOURCE_PCLK2  PCLK2 Clock selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_IC7    IC7 selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_IC8    IC8 selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_MSI    MSI selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_HSI    HSI selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_PIN    External I2S_CKIN selected as SAI1 clock
  *            @arg RCC_SAI1CLKSOURCE_SPDIFRX1 SPDIFRX1 selected as SAI1 clock
  */
#define __HAL_RCC_GET_SAI1_SOURCE() LL_RCC_GetSAIClockSource(LL_RCC_SAI1_CLKSOURCE)

/**
  * @brief  Macro to configure the SAI2 clock source.
  * @param  __SAI2_CLKSOURCE__ defines the SAI2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SAI2CLKSOURCE_PCLK2  PCLK2 Clock selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_CLKP   Peripheral clock CLKP selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_IC7    IC7 selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_IC8    IC8 selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_MSI    MSI selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_HSI    HSI selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_PIN    External I2S_CKIN selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_SPDIFRX1 SPDIFRX1 selected as SAI2 clock
  * @retval None
  */
#define __HAL_RCC_SAI2_CONFIG(__SAI2_CLKSOURCE__) \
  LL_RCC_SetSAIClockSource((__SAI2_CLKSOURCE__))

