micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the SAI2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SAI2CLKSOURCE_PCLK2  PCLK2 Clock selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_CLKP   Peripheral clock CLKP selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_IC7    IC7 selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_IC8    IC8 selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_MSI    MSI selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_HSI    HSI selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_PIN    External I2S_CKIN selected as SAI2 clock
  *            @arg RCC_SAI2CLKSOURCE_SPDIFRX1 SPDIFRX1 selected as SAI2 clock
  */
#define __HAL_RCC_GET_SAI2_SOURCE() LL_RCC_GetSAIClockSource(LL_RCC_SAI2_CLKSOURCE)

/** @brief  Macro to configure the SDMMC1 kernel clock source.
  * @param  __SDMMC1_CLKSOURCE__ specifies  clock source  for SDMMC1
  *        This parameter can be one of the following values:
  *            @arg RCC_SDMMC1CLKSOURCE_HCLK   HCLK Clock selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_IC4    IC4 selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_IC5    IC5 selected as SDMMC1 kernel clock
  */
#define __HAL_RCC_SDMMC1_CONFIG(__SDMMC1_CLKSOURCE__) \
  LL_RCC_SetSDMMCClockSource((__SDMMC1_CLKSOURCE__))

/** @brief  Macro to get the SDMMC1 kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SDMMC1CLKSOURCE_HCLK   HCLK Clock selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_IC4    IC4 selected as SDMMC1 kernel clock
  *            @arg RCC_SDMMC1CLKSOURCE_IC5    IC5 selected as SDMMC1 kernel clock
  */
#define __HAL_RCC_GET_SDMMC1_SOURCE() LL_RCC_GetSDMMCClockSource(LL_RCC_SDMMC1_CLKSOURCE)

/** @brief  Macro to configure the SDMMC2 kernel clock source.
  * @param  __SDMMC2_CLKSOURCE__ specifies  clock source  for SDMMC2
  *        This parameter can be one of the following values:
  *            @arg RCC_SDMMC2CLKSOURCE_HCLK   HCLK Clock selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_CLKP   Peripheral clock CLKP selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_IC4    IC4 selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_IC5    IC5 selected as SDMMC2 kernel clock
  */
#define __HAL_RCC_SDMMC2_CONFIG(__SDMMC2_CLKSOURCE__) \
  LL_RCC_SetSDMMCClockSource((__SDMMC2_CLKSOURCE__))

/** @brief  Macro to get the SDMMC2 kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SDMMC2CLKSOURCE_HCLK   HCLK Clock selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_CLKP   Peripheral clock CLKP selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_IC4    IC4 selected as SDMMC2 kernel clock
  *            @arg RCC_SDMMC2CLKSOURCE_IC5    IC5 selected as SDMMC2 kernel clock
  */
#define __HAL_RCC_GET_SDMMC2_SOURCE() LL_RCC_GetSDMMCClockSource(LL_RCC_SDMMC2_CLKSOURCE)

/**
  * @brief  Macro to Configure the SPDIFRX1 clock source.
  * @param  __SPDIFRX_CLKSOURCE__ defines the SPDIFRX1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SPDIFRX1CLKSOURCE_PCLK1  PCLK1 Clock selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_IC7    IC7 selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_IC8    IC8 selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_MSI    MSI selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_HSI    HSI selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_PIN    External I2S_CKIN selected as SPDIFRX1 clock
  * @retval None
  */
#define __HAL_RCC_SPDIFRX1_CONFIG(__SPDIFRX_CLKSOURCE__ ) \
  LL_RCC_SetSPDIFRXClockSource((__SPDIFRX_CLKSOURCE__))

/**
  * @brief  Macro to get the SPDIFRX1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPDIFRX1CLKSOURCE_PCLK1  PCLK1 Clock selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_CLKP   Peripheral clock CLKP selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_IC7    IC7 selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_IC8    IC8 selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_MSI    MSI selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_HSI    HSI selected as SPDIFRX1 clock
  *            @arg RCC_SPDIFRX1CLKSOURCE_PIN    External I2S_CKIN selected as SPDIFRX1 clock
  * @retval None
  */
#define __HAL_RCC_GET_SPDIFRX1_SOURCE() LL_RCC_GetSPDIFRXClockSource(LL_RCC_SPDIFRX1_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI1 clock source.
  * @param  __SPI1_CLKSOURCE__ defines the SPI1 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI1CLKSOURCE_PCLK2  PCLK2 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_IC8    IC8 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_IC9    IC9 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_MSI    MSI selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_HSI    HSI selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_PIN    External I2S_CKIN selected as SPI1 clock
  * @retval None
  */
#define __HAL_RCC_SPI1_CONFIG(__SPI1_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI1_CLKSOURCE__))

/** @brief  Macro to get the SPI1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI1CLKSOURCE_PCLK2  PCLK2 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_IC8    IC8 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_IC9    IC9 selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_MSI    MSI selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_HSI    HSI selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_PIN    External I2S_CKIN selected as SPI1 clock
  */
#define __HAL_RCC_GET_SPI1_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI1_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI2 clock source.
  * @param  __SPI2_CLKSOURCE__ defines the SPI2 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI2CLKSOURCE_PCLK1  PCLK1 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_IC8    IC8 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_IC9    IC9 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_MSI    MSI selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_HSI    HSI selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_PIN    External I2S_CKIN selected as SPI2 clock
  * @retval None
  */
#define __HAL_RCC_SPI2_CONFIG(__SPI2_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI2_CLKSOURCE__))

/** @brief  Macro to get the SPI2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI2CLKSOURCE_PCLK1  PCLK1 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_IC8    IC8 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_IC9    IC9 selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_MSI    MSI selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_HSI    HSI selected as SPI2 clock
  *            @arg RCC_SPI2CLKSOURCE_PIN    External I2S_CKIN selected as SPI2 clock
  */
#define __HAL_RCC_GET_SPI2_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI2_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI3 clock source.
  * @param  __SPI3_CLKSOURCE__ defines the SPI3 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI3CLKSOURCE_PCLK1  PCLK1 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_IC8    IC8 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_IC9    IC9 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_MSI    MSI selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_HSI    HSI selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_PIN    External I2S_CKIN selected as SPI3 clock
  * @retval None
  */
#define __HAL_RCC_SPI3_CONFIG(__SPI3_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI3_CLKSOURCE__))

/** @brief  Macro to get the SPI3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI3CLKSOURCE_PCLK1  PCLK1 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_IC8    IC8 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_IC9    IC9 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_MSI    MSI selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_HSI    HSI selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_PIN    External I2S_CKIN selected as SPI3 clock
  */
#define __HAL_RCC_GET_SPI3_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI3_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI4 clock source.
  * @param  __SPI4_CLKSOURCE__ defines the SPI4 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI4CLKSOURCE_PCLK2  PCLK2 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_IC8    IC8 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_IC9    IC9 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_MSI    MSI selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_HSI    HSI selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_PIN    External I2S_CKIN selected as SPI4 clock
  * @retval None
  */
#define __HAL_RCC_SPI4_CONFIG(__SPI4_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI4_CLKSOURCE__))

