micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the SPI4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI4CLKSOURCE_PCLK2  PCLK2 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_IC8    IC8 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_IC9    IC9 selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_MSI    MSI selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_HSI    HSI selected as SPI4 clock
  *            @arg RCC_SPI4CLKSOURCE_PIN    External I2S_CKIN selected as SPI4 clock
  */
#define __HAL_RCC_GET_SPI4_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI4_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI5 clock source.
  * @param  __SPI5_CLKSOURCE__ defines the SPI5 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI5CLKSOURCE_PCLK2  PCLK2 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_IC8    IC8 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_IC9    IC9 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_MSI    MSI selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_HSI    HSI selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_PIN    External I2S_CKIN selected as SPI5 clock
  * @retval None
  */
#define __HAL_RCC_SPI5_CONFIG(__SPI5_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI5_CLKSOURCE__))

/** @brief  Macro to get the SPI5 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI5CLKSOURCE_PCLK2  PCLK2 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_IC8    IC8 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_IC9    IC9 selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_MSI    MSI selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_HSI    HSI selected as SPI5 clock
  *            @arg RCC_SPI5CLKSOURCE_PIN    External I2S_CKIN selected as SPI5 clock
  */
#define __HAL_RCC_GET_SPI5_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI5_CLKSOURCE)

/**
  * @brief  Macro to configure the SPI6 clock source.
  * @param  __SPI6_CLKSOURCE__ defines the SPI6 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI6CLKSOURCE_PCLK4  PCLK4 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_IC8    IC8 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_IC9    IC9 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_MSI    MSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSI    HSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PIN    External I2S_CKIN selected as SPI6 clock
  * @retval None
  */
#define __HAL_RCC_SPI6_CONFIG(__SPI6_CLKSOURCE__ ) \
  LL_RCC_SetSPIClockSource((__SPI6_CLKSOURCE__))

/** @brief  Macro to get the SPI6 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI6CLKSOURCE_PCLK4  PCLK4 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_CLKP   Peripheral clock CKLP selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_IC8    IC8 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_IC9    IC9 selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_MSI    MSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSI    HSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PIN    External I2S_CKIN selected as SPI6 clock
  */
#define __HAL_RCC_GET_SPI6_SOURCE() LL_RCC_GetSPIClockSource(LL_RCC_SPI6_CLKSOURCE)

/** @brief  Macro to configure the USART1 clock source.
  * @param  __USART1_CLKSOURCE__ specifies the USART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK2  PCLK2 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_IC9    IC9 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_IC14   IC14 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_LSE    LSE selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_MSI    MSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  */
#define __HAL_RCC_USART1_CONFIG(__USART1_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__USART1_CLKSOURCE__))

/** @brief  Macro to get the USART1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK2  PCLK2 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_IC9    IC9 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_IC14   IC14 selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_LSE    LSE selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_MSI    MSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  */
#define __HAL_RCC_GET_USART1_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_USART1_CLKSOURCE)

/** @brief  Macro to configure the USART2 clock source.
  * @param  __USART2_CLKSOURCE__ specifies the USART2 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART2CLKSOURCE_PCLK1  PCLK1 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_IC9    IC9 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_IC14   IC14 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_LSE    LSE selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_MSI    MSI selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_HSI    HSI selected as USART2 clock
  */
#define __HAL_RCC_USART2_CONFIG(__USART2_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__USART2_CLKSOURCE__))

