micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the USART2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART2CLKSOURCE_PCLK1  PCLK1 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_IC9    IC9 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_IC14   IC14 selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_LSE    LSE selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_MSI    MSI selected as USART2 clock
  *            @arg RCC_USART2CLKSOURCE_HSI    HSI selected as USART2 clock
  */
#define __HAL_RCC_GET_USART2_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_USART2_CLKSOURCE)

/** @brief  Macro to configure the USART3 clock source.
  * @param  __USART3_CLKSOURCE__ specifies the USART3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART3CLKSOURCE_PCLK1  PCLK1 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_IC9    IC9 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_IC14   IC14 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_LSE    LSE selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_MSI    MSI selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_HSI    HSI selected as USART3 clock
  */
#define __HAL_RCC_USART3_CONFIG(__USART3_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__USART3_CLKSOURCE__))

/** @brief  Macro to get the USART3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART3CLKSOURCE_PCLK1  PCLK1 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_IC9    IC9 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_IC14   IC14 selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_LSE    LSE selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_MSI    MSI selected as USART3 clock
  *            @arg RCC_USART3CLKSOURCE_HSI    HSI selected as USART3 clock
  */
#define __HAL_RCC_GET_USART3_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_USART3_CLKSOURCE)

/** @brief  Macro to configure the UART4 clock source.
  * @param  __UART4_CLKSOURCE__ specifies the UART4 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART4CLKSOURCE_PCLK1  PCLK1 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_IC9    IC9 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_IC14   IC14 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_LSE    LSE selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_MSI    MSI selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSI    HSI selected as UART4 clock
  */
#define __HAL_RCC_UART4_CONFIG(__UART4_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__UART4_CLKSOURCE__))

/** @brief  Macro to get the UART4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART4CLKSOURCE_PCLK1  PCLK1 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_IC9    IC9 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_IC14   IC14 selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_LSE    LSE selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_MSI    MSI selected as UART4 clock
  *            @arg RCC_UART4CLKSOURCE_HSI    HSI selected as UART4 clock
  */
#define __HAL_RCC_GET_UART4_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_UART4_CLKSOURCE)

/** @brief  Macro to configure the UART5 clock source.
  * @param  __UART5_CLKSOURCE__ specifies the UART5 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART5CLKSOURCE_PCLK1  PCLK1 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_IC9    IC9 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_IC14   IC14 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_LSE    LSE selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_MSI    MSI selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_HSI    HSI selected as UART5 clock
  */
#define __HAL_RCC_UART5_CONFIG(__UART5_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__UART5_CLKSOURCE__))

/** @brief  Macro to get the UART5 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART5CLKSOURCE_PCLK1  PCLK1 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_IC9    IC9 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_IC14   IC14 selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_LSE    LSE selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_MSI    MSI selected as UART5 clock
  *            @arg RCC_UART5CLKSOURCE_HSI    HSI selected as UART5 clock
  */
#define __HAL_RCC_GET_UART5_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_UART5_CLKSOURCE)

/** @brief  Macro to configure the USART6 clock source.
  * @param  __USART6_CLKSOURCE__ specifies the USART6 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART6CLKSOURCE_PCLK2  PCLK2 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_IC9    IC9 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_IC14   IC14 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_LSE    LSE selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_MSI    MSI selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSI    HSI selected as USART6 clock
  */
#define __HAL_RCC_USART6_CONFIG(__USART6_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__USART6_CLKSOURCE__))

/** @brief  Macro to get the USART6 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART6CLKSOURCE_PCLK2  PCLK2 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_IC9    IC9 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_IC14   IC14 selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_LSE    LSE selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_MSI    MSI selected as USART6 clock
  *            @arg RCC_USART6CLKSOURCE_HSI    HSI selected as USART6 clock
  */
#define __HAL_RCC_GET_USART6_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_USART6_CLKSOURCE)

/** @brief  Macro to configure the UART7 clock source.
  * @param  __UART7_CLKSOURCE__ specifies the UART7 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART7CLKSOURCE_PCLK1  PCLK1 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_IC9    IC9 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_IC14   IC14 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_LSE    LSE selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_MSI    MSI selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_HSI    HSI selected as UART7 clock
  */
#define __HAL_RCC_UART7_CONFIG(__UART7_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__UART7_CLKSOURCE__))

/** @brief  Macro to get the UART7 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART7CLKSOURCE_PCLK1  PCLK1 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_IC9    IC9 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_IC14   IC14 selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_LSE    LSE selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_MSI    MSI selected as UART7 clock
  *            @arg RCC_UART7CLKSOURCE_HSI    HSI selected as UART7 clock
  */
#define __HAL_RCC_GET_UART7_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_UART7_CLKSOURCE)

