micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to configure the UART8 clock source.
  * @param  __UART8_CLKSOURCE__ specifies the UART8 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART8CLKSOURCE_PCLK1  PCLK1 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_IC9    IC9 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_IC14   IC14 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_LSE    LSE selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_MSI    MSI selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_HSI    HSI selected as UART8 clock
  */
#define __HAL_RCC_UART8_CONFIG(__UART8_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__UART8_CLKSOURCE__))

/** @brief  Macro to get the UART8 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART8CLKSOURCE_PCLK1  PCLK1 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_IC9    IC9 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_IC14   IC14 selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_LSE    LSE selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_MSI    MSI selected as UART8 clock
  *            @arg RCC_UART8CLKSOURCE_HSI    HSI selected as UART8 clock
  */
#define __HAL_RCC_GET_UART8_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_UART8_CLKSOURCE)

/** @brief  Macro to configure the UART9 clock source.
  * @param  __UART9_CLKSOURCE__ specifies the UART9 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_UART9CLKSOURCE_PCLK2  PCLK2 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_IC9    IC9 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_IC14   IC14 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_LSE    LSE selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_MSI    MSI selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_HSI    HSI selected as UART9 clock
  */
#define __HAL_RCC_UART9_CONFIG(__UART9_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__UART9_CLKSOURCE__))

/** @brief  Macro to get the UART9 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_UART9CLKSOURCE_PCLK2  PCLK2 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_CLKP   Peripheral clock CKLP selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_IC9    IC9 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_IC14   IC14 selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_LSE    LSE selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_MSI    MSI selected as UART9 clock
  *            @arg RCC_UART9CLKSOURCE_HSI    HSI selected as UART9 clock
  */
#define __HAL_RCC_GET_UART9_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_UART9_CLKSOURCE)

/** @brief  Macro to configure the USART10 clock source.
  * @param  __USART10_CLKSOURCE__ specifies the USART10 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART10CLKSOURCE_PCLK2  PCLK2 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_IC9    IC9 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_IC14   IC14 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_LSE    LSE selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_MSI    MSI selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_HSI    HSI selected as USART10 clock
  */
#define __HAL_RCC_USART10_CONFIG(__USART10_CLKSOURCE__) \
  LL_RCC_SetUSARTClockSource((__USART10_CLKSOURCE__))

/** @brief  Macro to get the USART10 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART10CLKSOURCE_PCLK2  PCLK2 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_CLKP   Peripheral clock CKLP selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_IC9    IC9 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_IC14   IC14 selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_LSE    LSE selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_MSI    MSI selected as USART10 clock
  *            @arg RCC_USART10CLKSOURCE_HSI    HSI selected as USART10 clock
  */
#define __HAL_RCC_GET_USART10_SOURCE() LL_RCC_GetUSARTClockSource(LL_RCC_USART10_CLKSOURCE)

/** @brief  Macro to configure the XSPI1 clock source.
  *
  * @param  __XSPI1_CLKSOURCE__ specifies the XSPI1 clock source.
  *            @arg RCC_XSPI1CLKSOURCE_HCLK  HCLK selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_IC3 IC3 selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_IC4 IC4 selected as XSPI1 clock
  */
#define __HAL_RCC_XSPI1_CONFIG(__XSPI1_CLKSOURCE__) \
  LL_RCC_SetXSPIClockSource((__XSPI1_CLKSOURCE__))

/** @brief  Macro to get the XSPI1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_XSPI1CLKSOURCE_HCLK  HCLK selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_IC3 IC3 selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_IC4 IC4 selected as XSPI1 clock
  */
#define __HAL_RCC_GET_XSPI1_SOURCE() LL_RCC_GetXSPIClockSource(LL_RCC_XSPI1_CLKSOURCE)

/** @brief  Macro to configure the XSPI2 clock source.
  *
  * @param  __XSPI2_CLKSOURCE__ specifies the XSPI2 clock source.
  *            @arg RCC_XSPI2CLKSOURCE_HCLK  HCLK selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_IC3 IC3 selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_IC4 IC4 selected as XSPI2 clock
  */
#define __HAL_RCC_XSPI2_CONFIG(__XSPI2_CLKSOURCE__) \
  LL_RCC_SetXSPIClockSource((__XSPI2_CLKSOURCE__))

/** @brief  Macro to get the XSPI2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_XSPI2CLKSOURCE_HCLK  HCLK selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_IC3 IC3 selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_IC4 IC4 selected as XSPI2 clock
  */
#define __HAL_RCC_GET_XSPI2_SOURCE() LL_RCC_GetXSPIClockSource(LL_RCC_XSPI2_CLKSOURCE)

/** @brief  Macro to configure the XSPI3 clock source.
  *
  * @param  __XSPI3_CLKSOURCE__ specifies the XSPI3 clock source.
  *            @arg RCC_XSPI3CLKSOURCE_HCLK  HCLK selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_IC3 IC3 selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_IC4 IC4 selected as XSPI3 clock
  */
#define __HAL_RCC_XSPI3_CONFIG(__XSPI3_CLKSOURCE__) \
  LL_RCC_SetXSPIClockSource((__XSPI3_CLKSOURCE__))

/** @brief  Macro to get the XSPI3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_XSPI3CLKSOURCE_HCLK  HCLK selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_CLKP Peripheral clock CKLP selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_IC3 IC3 selected as XSPI3 clock
  *            @arg RCC_XSPI3CLKSOURCE_IC4 IC4 selected as XSPI3 clock
  */
#define __HAL_RCC_GET_XSPI3_SOURCE() LL_RCC_GetXSPIClockSource(LL_RCC_XSPI3_CLKSOURCE)

/** @brief  Macro to configure the Timers clocks prescaler
  * @param  __PRESC__  specifies the Timers clocks prescaler selection
  *         This parameter can be one of the following values:
  *            @arg RCC_TIMPRES_DIV1 The Timers kernels clocks prescaler is 1
  *            @arg RCC_TIMPRES_DIV2 The Timers kernels clocks prescaler is 2
  *            @arg RCC_TIMPRES_DIV4 The Timers kernels clocks prescaler is 4
  *            @arg RCC_TIMPRES_DIV8 The Timers kernels clocks prescaler is 8
  */
#define __HAL_RCC_TIMCLKPRESCALER_CONFIG(__PRESC__) LL_RCC_SetTIMPrescaler((__PRESC__))

/** @brief  Macro to get the Timers clocks prescaler.
  * @retval Timers clocks prescaler can be one of the following values:
  *            @arg RCC_TIMPRES_DIV1 The Timers kernels clocks prescaler is 1
  *            @arg RCC_TIMPRES_DIV2 The Timers kernels clocks prescaler is 2
  *            @arg RCC_TIMPRES_DIV4 The Timers kernels clocks prescaler is 4
  *            @arg RCC_TIMPRES_DIV8 The Timers kernels clocks prescaler is 8
  */
#define __HAL_RCC_GET_TIMCLKPRESCALER() LL_RCC_GetTIMPrescaler()

/** @brief  Macro to configure the USBPHY1 clock.
  * @param  __USBPHY1_CLKSOURCE__ specifies the USBPHY1 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_USBPHY1REFCLKSOURCE_OTGPHY1         USB OTGPHY1 kernel clock selected as USBPHY1 clock
  *            @arg RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT      HSE from oscillator selected as USBPHY1 clock
  *            @arg RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT_DIV2 HSE from oscillator divided by 2 selected as USBPHY1 clock
  */
#define __HAL_RCC_USBPHY1_CONFIG(__USBPHY1_CLKSOURCE__)                               \
  do                                                                                  \
  {                                                                                   \
    LL_RCC_SetOTGPHYCKREFClockSource((__USBPHY1_CLKSOURCE__) & 0x7FFFFFFFUL);         \
    if(((__USBPHY1_CLKSOURCE__)>>31U) == 1UL) {LL_RCC_HSE_SelectHSEDiv2AsDiv2Clock();} \
      else {LL_RCC_HSE_SelectHSEAsDiv2Clock();}                                         \
  } while (0)


/** @brief  Macro to get the USBPHY1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USBPHY1REFCLKSOURCE_OTGPHY1         USB OTGPHY1 kernel clock selected as USBPHY1 clock
  *            @arg RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT      HSE from oscillator selected as USBPHY1 clock
  *            @arg RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT_DIV2 HSE from oscillator divided by 2 selected as USBPHY1 clock
  */
#define __HAL_RCC_GET_USBPHY1_SOURCE()                       \
  (LL_RCC_GetOTGPHYCKREFClockSource(LL_RCC_OTGPHY1CKREF_CLKSOURCE) | (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock()<<31U))

/** @brief  Macro to configure the USBPHY2 clock.
  * @param  __USBPHY2_CLKSOURCE__ specifies the USBPHY2 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_USBPHY2REFCLKSOURCE_OTGPHY2         USB OTGPHY2 kernel clock selected as USBPHY2 clock
  *            @arg RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT      HSE from oscillator selected as USBPHY2 clock
  *            @arg RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT_DIV2 HSE from oscillator divided by 2 selected as USBPHY2 clock
  */
#define __HAL_RCC_USBPHY2_CONFIG(__USBPHY2_CLKSOURCE__)                                 \
  do                                                                                    \
  {                                                                                     \
    LL_RCC_SetOTGPHYCKREFClockSource((__USBPHY2_CLKSOURCE__) & 0x7FFFFFFFUL);           \
    if(((__USBPHY2_CLKSOURCE__)>>31U) == 1UL) {LL_RCC_HSE_SelectHSEDiv2AsDiv2Clock();} \
      else {LL_RCC_HSE_SelectHSEAsDiv2Clock();}                                         \
  } while (0)

