micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
/** @brief  Macro to get the USBPHY2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USBPHY2REFCLKSOURCE_OTGPHY2         USB OTGPHY2 kernel clock selected as USBPHY2 clock
  *            @arg RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT      HSE from oscillator selected as USBPHY2 clock
  *            @arg RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT_DIV2 HSE from oscillator divided by 2 selected as USBPHY2 clock
  */
#define __HAL_RCC_GET_USBPHY2_SOURCE()                       \
  (LL_RCC_GetOTGPHYCKREFClockSource(LL_RCC_OTGPHY2CKREF_CLKSOURCE) | (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock()<<31U))

/** @brief  Macro to configure the USB OTGHS1 clock.
  * @param  __USBOTGHS1_CLKSOURCE__ specifies the USB OTGHS1 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_USBOTGHS1CLKSOURCE_HSE_DIV2      HSE divided by 2 selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_CLKP          Peripheral clock CKLP selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_IC15          IC15 selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_HSE_DIV_2_OSC HSE divided by 2 from oscillator selected as USBOTGHS1 clock
  */
#define __HAL_RCC_USBOTGHS1_CONFIG(__USBOTGHS1_CLKSOURCE__)                             \
  do                                                                                    \
  {                                                                                     \
    LL_RCC_SetOTGPHYClockSource((__USBOTGHS1_CLKSOURCE__) & 0x7FFFFFFFUL);              \
    if(((__USBOTGHS1_CLKSOURCE__)>>31U) == 1UL) {LL_RCC_HSE_SelectHSEDiv2AsDiv2Clock();} \
      else {LL_RCC_HSE_SelectHSEAsDiv2Clock();}                                           \
  } while (0)

/** @brief  Macro to get the USB OTGHS1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USBOTGHS1CLKSOURCE_HSE_DIV2      HSE divided by 2 selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_CLKP          Peripheral clock CKLP selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_IC15          IC15 selected as USBOTGHS1 clock
  *            @arg RCC_USBOTGHS1CLKSOURCE_HSE_DIV_2_OSC HSE divided by 2 from oscillator selected as USBOTGHS1 clock
  */
#define __HAL_RCC_GET_USBOTGHS1_SOURCE()                       \
  (LL_RCC_GetOTGPHYClockSource(LL_RCC_OTGPHY1_CLKSOURCE) | (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock()<<31U))

/** @brief  Macro to configure the USB OTGHS2 clock.
  * @param  __USBOTGHS2_CLKSOURCE__ specifies the USB OTGHS2 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_USBOTGHS2CLKSOURCE_HSE_DIV2      HSE divided by 2 selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2CLKSOURCE_CLKP          Peripheral clock CKLP selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2CLKSOURCE_IC15          IC15 selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2CLKSOURCE_HSE_DIV_2_OSC HSE divided by 2 from oscillator selected as USBOTGHS2 clock
  */
#define __HAL_RCC_USBOTGHS2_CONFIG(__USBOTGHS2_CLKSOURCE__)                             \
  do                                                                                    \
  {                                                                                     \
    LL_RCC_SetOTGPHYClockSource((__USBOTGHS2_CLKSOURCE__) & 0x7FFFFFFFUL);              \
    if(((__USBOTGHS2_CLKSOURCE__)>>31U) == 1UL) {LL_RCC_HSE_SelectHSEDiv2AsDiv2Clock();} \
      else {LL_RCC_HSE_SelectHSEAsDiv2Clock();}                                           \
  } while (0)

/** @brief  Macro to get the USB OTGHS2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USBOTGHS2CLKSOURCE_HSE_DIV2      HSE divided by 2 selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2CLKSOURCE_CLKP          Peripheral clock CKLP selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2C LKSOURCE_IC15          IC15 selected as USBOTGHS2 clock
  *            @arg RCC_USBOTGHS2CLKSOURCE_HSE_DIV_2_OSC HSE divided by 2 from oscillator selected as USBOTGHS2 clock
  */
#define __HAL_RCC_GET_USBOTGHS2_SOURCE()                       \
  (LL_RCC_GetOTGPHYClockSource(LL_RCC_OTGPHY2_CLKSOURCE) | (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock()<<31U))

/**
  * @brief Enable the RCC LSE CSS Extended Interrupt Line.
  * @retval None
  */
#define __HAL_RCC_LSECSS_EXTI_ENABLE_IT()      SET_BIT(EXTI->IMR3, RCC_EXTI_LINE_LSECSS)

/**
  * @brief Disable the RCC LSE CSS Extended Interrupt Line.
  * @retval None
  */
#define __HAL_RCC_LSECSS_EXTI_DISABLE_IT()     CLEAR_BIT(EXTI->IMR3, RCC_EXTI_LINE_LSECSS)

/**
  * @brief Enable the RCC LSE CSS Event Line.
  * @retval None.
  */
#define __HAL_RCC_LSECSS_EXTI_ENABLE_EVENT()   SET_BIT(EXTI->EMR3, RCC_EXTI_LINE_LSECSS)

/**
  * @brief Disable the RCC LSE CSS Event Line.
  * @retval None.
  */
#define __HAL_RCC_LSECSS_EXTI_DISABLE_EVENT()  CLEAR_BIT(EXTI->EMR3, RCC_EXTI_LINE_LSECSS)

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCCEx_Exported_Functions
  * @{
  */

/** @addtogroup RCCEx_Exported_Functions_Group1
  * @{
  */
HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(const RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
void HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint64_t PeriphClk);
uint32_t HAL_RCCEx_GetPLL1CLKFreq(void);
uint32_t HAL_RCCEx_GetPLL2CLKFreq(void);
uint32_t HAL_RCCEx_GetPLL3CLKFreq(void);
uint32_t HAL_RCCEx_GetPLL4CLKFreq(void);
/**
  * @}
  */

/** @addtogroup RCCEx_Exported_Functions_Group2
  * @{
  */
void     HAL_RCCEx_WakeUpStopCLKConfig(uint32_t WakeUpClk);
void     HAL_RCCEx_EnableLSECSS(void);
void     HAL_RCCEx_DisableLSECSS(void);
void     HAL_RCCEx_EnableLSECSS_IT(void);
void     HAL_RCCEx_DisableLSECSS_IT(void);
void     HAL_RCCEx_ReArmLSECSS(void);
void     HAL_RCCEx_LSECSS_IRQHandler(void);
void     HAL_RCCEx_LSECSS_Callback(void);
HAL_StatusTypeDef HAL_RCCEx_PLLSSCGConfig(uint32_t PLLnumber, const RCC_PLLInitTypeDef *pPLLInit,
                                          const RCC_PLLSSCGInitTypeDef *pPLLSSCGInit);

/**
  * @}
  */

/**
  * @}
  */

