micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
#define IS_RCC_CKPERCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_CLKPCLKSOURCE_HSI) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_MSI) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_HSE) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_IC19) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_IC5) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_CLKPCLKSOURCE_IC20))

#define IS_RCC_DCMIPPCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_DCMIPPCLKSOURCE_PCLK5) || \
   ((__SOURCE__) == RCC_DCMIPPCLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_DCMIPPCLKSOURCE_IC17)  || \
   ((__SOURCE__) == RCC_DCMIPPCLKSOURCE_HSI))

#define IS_RCC_ETH1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_ETH1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_ETH1CLKSOURCE_IC12) || \
   ((__SOURCE__) == RCC_ETH1CLKSOURCE_HSE))

#define IS_RCC_ETH1PHYIF(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1PHYIF_MII)   || \
   ((__SOURCE__) == RCC_ETH1PHYIF_RGMII) || \
   ((__SOURCE__) == RCC_ETH1PHYIF_RMII))

#define IS_RCC_ETH1RXCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1RXCLKSOURCE_EXT)   || \
   ((__SOURCE__) == RCC_ETH1RXCLKSOURCE_INT))

#define IS_RCC_ETH1TXCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1TXCLKSOURCE_EXT)   || \
   ((__SOURCE__) == RCC_ETH1TXCLKSOURCE_INT))

#define IS_RCC_ETH1PTPCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1PTPCLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_ETH1PTPCLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_ETH1PTPCLKSOURCE_IC13) || \
   ((__SOURCE__) == RCC_ETH1PTPCLKSOURCE_HSE))

#define IS_RCC_ETH1PTPDIVIDER(__VALUE__) \
  ((1U <= (__VALUE__)) && ((__VALUE__) <= 16U))

#define IS_RCC_FDCANCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_FDCANCLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_FDCANCLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_FDCANCLKSOURCE_IC19)  || \
   ((__SOURCE__) == RCC_FDCANCLKSOURCE_HSE))

#define IS_RCC_FMCCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_FMCCLKSOURCE_HCLK)  || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_IC3) || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_IC4))

#define IS_RCC_I2C1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I2C1CLKSOURCE_HSI))

#define IS_RCC_I2C2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C2CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I2C2CLKSOURCE_HSI))

#define IS_RCC_I2C3CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C3CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I2C3CLKSOURCE_HSI))

#define IS_RCC_I2C4CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C4CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C4CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I2C4CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I2C4CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I2C4CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I2C4CLKSOURCE_HSI))

#define IS_RCC_I3C1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I3C1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_HSI))

#define IS_RCC_I3C2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I3C2CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I3C2CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_I3C2CLKSOURCE_IC10) || \
   ((__SOURCE__) == RCC_I3C2CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_I3C2CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_I3C2CLKSOURCE_HSI))

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_TIMG))

#define IS_RCC_LPTIM2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM2CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_TIMG))

#define IS_RCC_LPTIM3CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM3CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM3CLKSOURCE_TIMG))

#define IS_RCC_LPTIM4CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM4CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM4CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_LPTIM4CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_LPTIM4CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM4CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM4CLKSOURCE_TIMG))

#define IS_RCC_LPTIM5CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM5CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM5CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_LPTIM5CLKSOURCE_IC15) || \
   ((__SOURCE__) == RCC_LPTIM5CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM5CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM5CLKSOURCE_TIMG))

#define IS_RCC_LPUART1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPUART1CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_HSI))

#define IS_RCC_LTDCCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LTDCCLKSOURCE_PCLK5) || \
   ((__SOURCE__) == RCC_LTDCCLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_LTDCCLKSOURCE_IC16)  || \
   ((__SOURCE__) == RCC_LTDCCLKSOURCE_HSI))

#define IS_RCC_MDF1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_MDF1CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_IC7)  || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_IC8)  || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_MSI)  || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_HSI)  || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_PIN)  || \
   ((__SOURCE__) == RCC_MDF1CLKSOURCE_TIMG))

#define IS_RCC_PSSICLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_PSSICLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_PSSICLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_PSSICLKSOURCE_IC20) || \
   ((__SOURCE__) == RCC_PSSICLKSOURCE_HSI))

#define IS_RCC_SAI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI1CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_IC7)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_SPDIFRX1))

#define IS_RCC_SAI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI2CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_IC7)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_SPDIFRX1))

#define IS_RCC_SDMMC1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SDMMC1CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_SDMMC1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_SDMMC1CLKSOURCE_IC4)  || \
   ((__SOURCE__) == RCC_SDMMC1CLKSOURCE_IC5))

#define IS_RCC_SDMMC2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SDMMC2CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_SDMMC2CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_SDMMC2CLKSOURCE_IC4)  || \
   ((__SOURCE__) == RCC_SDMMC2CLKSOURCE_IC5))

#define IS_RCC_SPDIFRX1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_IC7)   || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPDIFRX1CLKSOURCE_PIN))

#define IS_RCC_SPI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI1CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PIN))

#define IS_RCC_SPI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI2CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI2CLKSOURCE_PIN))

#define IS_RCC_SPI3CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI3CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI3CLKSOURCE_PIN))

#define IS_RCC_SPI4CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI4CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI4CLKSOURCE_HSE))

#define IS_RCC_SPI5CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI5CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI5CLKSOURCE_HSE))

#define IS_RCC_SPI6CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI6CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_IC8)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_PIN))

