micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc_ex.h
#define IS_RCC_TIMPRES(__VALUE__)  \
  (((__VALUE__) == RCC_TIMPRES_DIV1) || \
   ((__VALUE__) == RCC_TIMPRES_DIV2) || \
   ((__VALUE__) == RCC_TIMPRES_DIV4) || \
   ((__VALUE__) == RCC_TIMPRES_DIV8))

#define IS_RCC_USART1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART1CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_HSI))

#define IS_RCC_USART2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART2CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USART2CLKSOURCE_HSI))

#define IS_RCC_USART3CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART3CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USART3CLKSOURCE_HSI))

#define IS_RCC_UART4CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_UART4CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_UART4CLKSOURCE_HSI))

#define IS_RCC_UART5CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_UART5CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_UART5CLKSOURCE_HSI))

#define IS_RCC_USART6CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART6CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USART6CLKSOURCE_HSI))

#define IS_RCC_UART7CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_UART7CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_UART7CLKSOURCE_HSI))

#define IS_RCC_UART8CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_UART8CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_UART8CLKSOURCE_HSI))

#define IS_RCC_UART9CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_UART9CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_UART9CLKSOURCE_HSI))

#define IS_RCC_USART10CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART10CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_IC9)   || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_IC14)  || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_MSI)   || \
   ((__SOURCE__) == RCC_USART10CLKSOURCE_HSI))

#define IS_RCC_USBPHY1CLKSOURCE(__SOURCE__)                  \
  (((__SOURCE__) == RCC_USBPHY1REFCLKSOURCE_OTGPHY1)      || \
   ((__SOURCE__) == RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT)   || \
   ((__SOURCE__) == RCC_USBPHY1REFCLKSOURCE_HSE_DIRECT_DIV2))

#define IS_RCC_USBPHY2CLKSOURCE(__SOURCE__)                  \
  (((__SOURCE__) == RCC_USBPHY2REFCLKSOURCE_OTGPHY2)      || \
   ((__SOURCE__) == RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT)   || \
   ((__SOURCE__) == RCC_USBPHY2REFCLKSOURCE_HSE_DIRECT_DIV2))

#define IS_RCC_USBOTGHS1CLKSOURCE(__SOURCE__)                \
  (((__SOURCE__) == RCC_USBOTGHS1CLKSOURCE_HSE_DIV2)      || \
   ((__SOURCE__) == RCC_USBOTGHS1CLKSOURCE_CLKP)          || \
   ((__SOURCE__) == RCC_USBOTGHS1CLKSOURCE_IC15)          || \
   ((__SOURCE__) == RCC_USBOTGHS1CLKSOURCE_HSE_DIRECT)    || \
   ((__SOURCE__) == RCC_USBOTGHS1CLKSOURCE_HSE_DIRECT_DIV2))

#define IS_RCC_USBOTGHS2CLKSOURCE(__SOURCE__)                \
  (((__SOURCE__) == RCC_USBOTGHS2CLKSOURCE_HSE_DIV2)      || \
   ((__SOURCE__) == RCC_USBOTGHS2CLKSOURCE_CLKP)          || \
   ((__SOURCE__) == RCC_USBOTGHS2CLKSOURCE_IC15)          || \
   ((__SOURCE__) == RCC_USBOTGHS2CLKSOURCE_HSE_DIRECT)    || \
   ((__SOURCE__) == RCC_USBOTGHS2CLKSOURCE_HSE_DIRECT_DIV2))

#define IS_RCC_XSPI1CLKSOURCE(__SOURCE__)       \
  (((__SOURCE__) == RCC_XSPI1CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_XSPI1CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_XSPI1CLKSOURCE_IC3)  || \
   ((__SOURCE__) == RCC_XSPI1CLKSOURCE_IC4))

#define IS_RCC_XSPI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_XSPI2CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_XSPI2CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_XSPI2CLKSOURCE_IC3)  || \
   ((__SOURCE__) == RCC_XSPI2CLKSOURCE_IC4))

#define IS_RCC_XSPI3CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_XSPI3CLKSOURCE_HCLK) || \
   ((__SOURCE__) == RCC_XSPI3CLKSOURCE_CLKP) || \
   ((__SOURCE__) == RCC_XSPI3CLKSOURCE_IC3)  || \
   ((__SOURCE__) == RCC_XSPI3CLKSOURCE_IC4))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_RCC_EX_H */
